[
    {
        "step_number": 1,
        "direction": "In a shallow dish, mix together the garlic powder, pepper, salt, paprika, bread crumbs and flour. In a separate dish, whisk together the milk and egg.",
        "ingredients": {
            "garlic powder": null,
            "salt": null,
            "paprika": null,
            "milk": null,
            "egg": null
        },
        "tools": [
            {
                "size": null,
                "name": "whisk"
            },
            {
                "size": null,
                "name": "dish"
            }
        ],
        "methods": {
            "mix": {
                "subject": [
                    "powder"
                ],
                "duration": null,
                "until": null
            },
            "whisk": {
                "subject": [
                    "milk"
                ],
                "duration": null,
                "until": null
            }
        },
        "substeps": [
            "In a shallow dish, mix together the garlic powder, pepper, salt, paprika, bread crumbs and flour",
            "In a separate dish, whisk together the milk and egg"
        ]
    },
    {
        "step_number": 2,
        "direction": "Heat the oil in an electric skillet set to 350 degrees F (175 degrees C). Dip the chicken into the egg and milk, then dredge in the dry ingredients until evenly coated.",
        "ingredients": {
            "milk": null,
            "egg": null
        },
        "tools": [
            {
                "size": null,
                "name": "skillet"
            }
        ],
        "methods": {
            "heat": {
                "subject": [
                    "oil"
                ],
                "duration": "350 degrees F",
                "until": "evenly coated"
            }
        },
        "substeps": [
            "Heat the oil in an electric skillet set to 350 degrees F (175 degrees C)",
            "Dip the chicken into the egg and milk, then dredge in the dry ingredients until evenly coated"
        ]
    },
    {
        "step_number": 3,
        "direction": "Fry chicken in the hot oil for about 5 minutes per side, or until the chicken is cooked through and juices run clear. Remove from the oil with a slotted spatula, and serve.",
        "ingredients": {},
        "tools": [
            {
                "size": null,
                "name": "spatula"
            }
        ],
        "methods": {
            "fry": {
                "subject": [
                    "chicken"
                ],
                "duration": "about 5 minutes",
                "until": "the chicken is cooked through and juices run clear"
            },
            "serve": {
                "subject": [
                    "chicken"
                ],
                "duration": null,
                "until": null
            }
        },
        "substeps": [
            "Fry chicken in the hot oil for about 5 minutes per side, or until the chicken is cooked through and juices run clear",
            "Remove from the oil with a slotted spatula, and serve"
        ]
    },
    {
        "step_number": 4,
        "direction": "We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used.",
        "ingredients": {
            "oil for frying": null
        },
        "tools": [],
        "methods": {},
        "substeps": [
            "We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking",
            "The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used"
        ]
    }
]